In [222]:
import numpy as np
import pandas as pd

In [223]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [224]:
pd.Series(data=labels)
# 데이터 인덱스 만들어주기(이름 만들어주기)

0    a
1    b
2    c
dtype: object

In [225]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [226]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [227]:
pd.Series(data = my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [228]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [229]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [230]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR','Japan'])

In [231]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [232]:
ser1[0]

1

In [233]:
ser1['USA']

1

In [234]:
from numpy.random import randn
np.random.seed(5)

df=pd.DataFrame(randn(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())

In [235]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [236]:
df['W']

A    0.441227
B    0.109610
C    0.187603
D   -0.358829
E    1.151391
Name: W, dtype: float64

# DataFrame의 column 불러오기 연습

In [237]:
df[['W']]

          W
A  0.441227
B  0.109610
C  0.187603
D -0.358829
E  1.151391

In [238]:
df[['W','Z']]

          W         Z
A  0.441227 -0.252092
B  0.109610 -0.591637
C  0.187603 -0.204877
D -0.358829 -0.700179
E  1.151391  0.644848

In [239]:
df=pd.DataFrame(randn(5,5),index='A B C D E'.split(), columns='W X Y Z new'.split())

In [240]:
df

          W         X         Y         Z       new
A -0.980608 -0.856853 -0.871879 -0.422508  0.996440
B  0.712421  0.059144 -0.363311  0.003289 -0.105930
C  0.793053 -0.631572 -0.006195 -0.101068 -0.052308
D  0.249218  0.197660  1.334849 -0.086876  1.561532
E -0.305853 -0.477731  0.100738  0.355438  0.269612

In [241]:
df['new']=df['W']+df['Y']

In [242]:
df

          W         X         Y         Z       new
A -0.980608 -0.856853 -0.871879 -0.422508 -1.852487
B  0.712421  0.059144 -0.363311  0.003289  0.349110
C  0.793053 -0.631572 -0.006195 -0.101068  0.786858
D  0.249218  0.197660  1.334849 -0.086876  1.584066
E -0.305853 -0.477731  0.100738  0.355438 -0.205115

In [243]:
df.drop('new',axis=1,inplace=True)
# inplace=True가 절대적으로 영향을 미쳤음.

In [244]:
df

          W         X         Y         Z
A -0.980608 -0.856853 -0.871879 -0.422508
B  0.712421  0.059144 -0.363311  0.003289
C  0.793053 -0.631572 -0.006195 -0.101068
D  0.249218  0.197660  1.334849 -0.086876
E -0.305853 -0.477731  0.100738  0.355438

In [245]:
df.drop('E',axis=0)
# axis는 축, 아래아래 출력결과 행열의 인덱스 번호가 0과 1이여서
# 행을 뺄 떄에는 0이라 axis를 안 써도 된다.

          W         X         Y         Z
A -0.980608 -0.856853 -0.871879 -0.422508
B  0.712421  0.059144 -0.363311  0.003289
C  0.793053 -0.631572 -0.006195 -0.101068
D  0.249218  0.197660  1.334849 -0.086876

In [246]:
df.shape

(5, 4)

In [247]:
df.loc[['A']]

          W         X         Y         Z
A -0.980608 -0.856853 -0.871879 -0.422508

In [248]:
df.loc['A']

W   -0.980608
X   -0.856853
Y   -0.871879
Z   -0.422508
Name: A, dtype: float64

In [249]:
df.iloc[2]

W    0.793053
X   -0.631572
Y   -0.006195
Z   -0.101068
Name: C, dtype: float64

In [250]:
df.loc['B'].iloc[2]

-0.3633108784819174

In [251]:
df.loc['B','Y']

-0.3633108784819174

In [252]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.980608 -0.871879
B  0.712421 -0.363311

# DataFrame의 conditional selection(조건부 선택)

In [253]:
df

          W         X         Y         Z
A -0.980608 -0.856853 -0.871879 -0.422508
B  0.712421  0.059144 -0.363311  0.003289
C  0.793053 -0.631572 -0.006195 -0.101068
D  0.249218  0.197660  1.334849 -0.086876
E -0.305853 -0.477731  0.100738  0.355438

In [254]:
df[df['W']>0]

          W         X         Y         Z
B  0.712421  0.059144 -0.363311  0.003289
C  0.793053 -0.631572 -0.006195 -0.101068
D  0.249218  0.197660  1.334849 -0.086876

In [255]:
df[df["W"]>0][['Y']]

          Y
B -0.363311
C -0.006195
D  1.334849

In [256]:
df[df["W"]>0][['X','Y']]

          X         Y
B  0.059144 -0.363311
C -0.631572 -0.006195
D  0.197660  1.334849

In [257]:
df[df["W"]>0]['Y']

B   -0.363311
C   -0.006195
D    1.334849
Name: Y, dtype: float64

In [258]:
df[df['W']>0][['Y']]>1

       Y
B  False
C  False
D   True

In [259]:
df[(df["W"]>0)&(df['Y']>1)]
# 두 조건을 만족하게 할려면 and(&)

          W        X         Y         Z
D  0.249218  0.19766  1.334849 -0.086876

# More Index Details부터 시작

In [260]:
df_score=pd.DataFrame(index='John Mary Peter Paul'.split(), columns='Math Scince English Coding'.split())

In [261]:
df_score.loc['John']=[40,30,60,100]
df_score.loc['Mary']=[90,100,20,30]
df_score.loc['Peter']=[50,20,90,99]
df_score.loc['Paul']=[10,40,100,90]

In [262]:
df_score

      Math Scince English Coding
John    40     30      60    100
Mary    90    100      20     30
Peter   50     20      90     99
Paul    10     40     100     90

In [263]:
# pd.DataFrame(data명, index, columns)
# pd.DataFrame(data를 산출하는 함수(사이즈),index,columns)

In [264]:
df_score['총점']=df_score['Math']+df_score['Scince']+df_score['English']+df_score['Coding']

In [265]:
df_score.loc['Titus']=[80,30,60,90,260]

In [266]:
df_score

      Math Scince English Coding   총점
John    40     30      60    100  230
Mary    90    100      20     30  240
Peter   50     20      90     99  259
Paul    10     40     100     90  240
Titus   80     30      60     90  260

In [267]:
df_score['Music']=[90,30,40,20,10]

In [268]:
df_score

      Math Scince English Coding   총점  Music
John    40     30      60    100  230     90
Mary    90    100      20     30  240     30
Peter   50     20      90     99  259     40
Paul    10     40     100     90  240     20
Titus   80     30      60     90  260     10

In [275]:
df_score=df_score[['Math','Scince','English','Coding','Music','총점']]

In [276]:
df_score

      Math Scince English Coding  Music   총점
John    40     30      60    100     90  230
Mary    90    100      20     30     30  240
Peter   50     20      90     99     40  259
Paul    10     40     100     90     20  240
Titus   80     30      60     90     10  260

In [277]:
df_score['평균']=(df_score['Math']+df_score['Scince']+df_score['English']+df_score['Coding']+df_score['Music'])/5

In [278]:
df_score

      Math Scince English Coding  Music   총점    평균
John    40     30      60    100     90  230  64.0
Mary    90    100      20     30     30  240  54.0
Peter   50     20      90     99     40  259  59.8
Paul    10     40     100     90     20  240  52.0
Titus   80     30      60     90     10  260  54.0

In [279]:
df_score[(df_score['Coding']>50)&(df_score['Math']>50)]

      Math Scince English Coding  Music   총점    평균
Titus   80     30      60     90     10  260  54.0

In [280]:
df

          W         X         Y         Z
A -0.980608 -0.856853 -0.871879 -0.422508
B  0.712421  0.059144 -0.363311  0.003289
C  0.793053 -0.631572 -0.006195 -0.101068
D  0.249218  0.197660  1.334849 -0.086876
E -0.305853 -0.477731  0.100738  0.355438

In [281]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.980608 -0.856853 -0.871879 -0.422508
1     B  0.712421  0.059144 -0.363311  0.003289
2     C  0.793053 -0.631572 -0.006195 -0.101068
3     D  0.249218  0.197660  1.334849 -0.086876
4     E -0.305853 -0.477731  0.100738  0.355438

In [282]:
df['States']=['CA','NY','WY','OR','CO']

In [283]:
df

          W         X         Y         Z States
A -0.980608 -0.856853 -0.871879 -0.422508     CA
B  0.712421  0.059144 -0.363311  0.003289     NY
C  0.793053 -0.631572 -0.006195 -0.101068     WY
D  0.249218  0.197660  1.334849 -0.086876     OR
E -0.305853 -0.477731  0.100738  0.355438     CO

In [290]:
df.set_index('States',inplace=True)

In [291]:
df

               W         X         Y         Z
States
CA     -0.980608 -0.856853 -0.871879 -0.422508
NY      0.712421  0.059144 -0.363311  0.003289
WY      0.793053 -0.631572 -0.006195 -0.101068
OR      0.249218  0.197660  1.334849 -0.086876
CO     -0.305853 -0.477731  0.100738  0.355438

# 다중 인덱스와 인덱스 간의 계층

In [294]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [295]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [296]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.291963  1.139343
   2  0.494440 -0.336336
   3 -0.100614  1.413398
G2 1  0.221254 -1.310773
   2 -0.689565 -0.577513
   3  1.152205 -0.107164

In [314]:
df.loc['G1']

          A         B
1  1.291963  1.139343
2  0.494440 -0.336336
3 -0.100614  1.413398

In [315]:
df.loc['G1'].iloc[1]

A    0.494440
B   -0.336336
Name: 2, dtype: float64

In [331]:
score2 = [[30,60],[100,50],[10,20],[90,80],[44,41],[70,77]]

In [332]:
df_score2=pd.DataFrame(score2, index=hier_index,columns=['수학','영어'])

In [333]:
df_score2

       수학  영어
G1 1   30  60
   2  100  50
   3   10  20
G2 1   90  80
   2   44  41
   3   70  77

In [353]:
df_score2.loc['G1'].loc[1]['영어']

60

In [355]:
df_score2.loc['G2'].loc[2]['수학']

44

In [359]:
df_score2.index.names = ['반','번호']
# 인덱스 이름 지어주기

In [360]:
df_score2

        수학  영어
반  번호
G1 1    30  60
   2   100  50
   3    10  20
G2 1    90  80
   2    44  41
   3    70  77